In [1]:
import pandas as pd
import numpy as np

In [2]:
# get data
economic_indicator_full = pd.read_csv('data/economic_indicator.csv')
population_full = pd.read_csv('data/population.csv')
cpi_full = pd.read_csv('data/cpi.csv')
gdp_and_production_full = pd.read_csv('data/gdp_and_productivity.csv')
health_full = pd.read_csv('data/health.csv')
ppp_full = pd.read_csv('data/ppp.csv')
productivity_ulc_full = pd.read_csv('data/productivity_ulc.csv')
resident_full = pd.read_csv('data/resident.csv')

In [20]:
# get relevant columns from data
economic_indicator = economic_indicator_full[['Subject', 'Country', 'Time', 'Value']]
population = population_full[['Country', 'Time', 'Value']]
cpi = cpi_full[['Subject', 'Country', 'Time', 'Value']]
gdp_production = gdp_and_production_full[['Subject', 'Country', 'Time', 'Value']]
health = health_full[['Function', 'Country', 'Year', 'Value']]
ppp = ppp_full[['Indicator', 'Country', 'Time', 'Value']]
productivity_ulc = productivity_ulc_full[['Subject', 'Country', 'Time', 'Value']]
resident = resident_full[['Subject', 'Country', 'Time', 'Value']]

Check if data has correct columns.

In [21]:
economic_indicator.head()

                  Subject    Country  Time      Value
0  Exports in goods, s.a.  Australia  2001  -0.760659
1  Exports in goods, s.a.  Australia  2002   2.662121
2  Exports in goods, s.a.  Australia  2003   8.290835
3  Exports in goods, s.a.  Australia  2004  22.734789
4  Exports in goods, s.a.  Australia  2005  22.454699

In [22]:
population.head()

     Country  Time       Value
0  Australia  2001   9712875.0
1  Australia  2002   9819727.0
2  Australia  2003   9933140.0
3  Australia  2004  10036771.0
4  Australia  2005  10157211.0

In [23]:
cpi.head()

                  Subject       Country  Time     Value
0  CPI: 01-12 - All items  Saudi Arabia  2001 -1.120944
1  CPI: 01-12 - All items  Saudi Arabia  2002  0.247187
2  CPI: 01-12 - All items  Saudi Arabia  2003  0.612193
3  CPI: 01-12 - All items  Saudi Arabia  2004  0.515508
4  CPI: 01-12 - All items  Saudi Arabia  2005  0.479233

In [24]:
gdp_production.head()

                                  Subject    Country  Time        Value
0  Gross Domestic Product (GDP); millions  Australia  2001  568121.2860
1  Gross Domestic Product (GDP); millions  Australia  2002  599301.2200
2  Gross Domestic Product (GDP); millions  Australia  2003  635902.7982
3  Gross Domestic Product (GDP); millions  Australia  2004  674858.4809
4  Gross Domestic Product (GDP); millions  Australia  2005  717705.0792

In [25]:
health.head()

                                        Function  Country  Year  Value
0  Current expenditure on health (all functions)  Denmark  2001  8.448
1  Current expenditure on health (all functions)  Denmark  2002  8.703
2  Current expenditure on health (all functions)  Denmark  2003  8.904
3  Current expenditure on health (all functions)  Denmark  2004  9.007
4  Current expenditure on health (all functions)  Denmark  2005  9.091

In [26]:
ppp.head()

                   Indicator    Country  Time  Value
0  Purchasing Power Parities  Australia  2001   1.33
1  Purchasing Power Parities  Australia  2002   1.34
2  Purchasing Power Parities  Australia  2003   1.35
3  Purchasing Power Parities  Australia  2004   1.37
4  Purchasing Power Parities  Australia  2005   1.39

In [27]:
productivity_ulc.head()

                  Subject    Country  Time     Value
0  Total capital services  Australia  2001  3.994049
1  Total capital services  Australia  2002  4.686434
2  Total capital services  Australia  2003  4.668319
3  Total capital services  Australia  2004  5.077356
4  Total capital services  Australia  2005  5.735487

In [28]:
resident.head()

,Subject,Country,Time,Value
0,RPPI - Total stock of newly-built and existing...,Australia,2005,1.829054
1,RPPI - Total stock of newly-built and existing...,Australia,2006,6.908463
2,RPPI - Total stock of newly-built and existing...,Australia,2007,10.533118
3,RPPI - Total stock of newly-built and existing...,Australia,2008,3.946215
4,RPPI - Total stock of newly-built and existing...,Australia,2009,4.049494